[
  {
    "title": "Full-Stack .NET Developer",
    "url": "https://www.seek.com.au/job/78306444?type=standout&ref=search-standalone&origin=cardTitle#sol=7323e3df04ea495c2974d35f67792e90c11232a5",
    "company": "Southgate Salary Packaging",
    "location": "Port Melbourne",
    "salary": "$90,000 – $110,000 plus superannuation",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Dynamic role with scope for innovation & creativity",
      "Employee Benefits Program",
      "Access to salary packaging (fringe benefits)"
    ],
    "description": "Permanent Full-stack IT developer role using a range of technologies to develop and maintain new innovative systems and features.",
    "postedDate": "4d ago",
    "fullDescription": "The Opportunity:\n\nWe are looking for an experienced Full Stack .NET Developer to join our in-house development team. You will work collaboratively with, and report to, the IT Manager to facilitate ongoing innovative software development for The Southgate Group.\n\n \n\nWe’re a forward-thinking company that takes pride in the highly functional and user-friendly solutions that we develop for our staff and our clients. We have a proactive philosophy, which drives us to custom build our systems and strive for continuous improvement and development.\n\n \n\n \n\nYour Responsibilities:\nFront-end and back-end development;\nContinued development and maintenance of .NET desktop applications and reporting solutions in C# & VB.NET;\nContinued development and maintenance of web-based systems and applications and reporting solutions, including but not limited to:\nthe creation and maintenance of websites;\nintegration of database reporting functionality with web-based client portals;\nthe development and maintenance of mobile applications for iOS and android devices;\nAssisting with the implementation and maintenance of APIs;\nAssisting with the planning, execution, testing and documentation phases of system developments and updates;\nCreation and maintenance of unit tests;\nDocumenting all technical details of your projects to ensure clarity and maintainability;\nImplementing best practices for system design, coding, performance and security;\nCollaborating with IT team members and other staff as necessary to ensure that solutions are purpose-driven, effective and user-friendly;\nHandling internal support enquiries, software bugs and feature requests as assigned by the IT Manager / IT Helpdesk; and\nStaying updated with the latest technologies and industry trends.\n\n \n\n \n\nAbout You:\n\n \n\nEssential skills you must have:\n\nMinimum 3 years experience in developer role\nFormal IT Qualification (or equivalent experience in role)\n.NET Core / .NET 6+, C# (ideally also experienced with VB.NET)\nJavaScript frontend frameworks (experience with desirable)\nVisual Studio 2019 / 2022, Visual Studio Code\nMicrosoft Web API / REST Architecture\nCI/CD Practices\nSQL Server 2019 and later\nAndroid/iOS/Xamarin/MAUI mobile development\n\n \n\nDesired skills:\n\nAzure DevOps/Git\nExperience with Telerik suite of controls\nCloud architecture experience\nGood understanding of computer security and cryptography\nExperience with unit and automated testing frameworks\nBlazor experience is a bonus\n\n \n\nYour attributes:\n\nWell organised with a detail-oriented mindset\nAbility to communicate clearly and effectively (verbally and in writing)\nProven ability to produce clear and concise documentation as required\nA positive attitude and willingness to learn and adapt to new technologies\nAbility to work autonomously and manage your own task scheduling to meet deadlines\nStrong problem-solving skills\n\n \n\n \n\n \n\nAbout Us:\n\nThe Southgate Group is a leading provider of Fleet Management Services, Financial Services and Salary Packaging Services nationwide. Our core services are focused on creating better efficiencies within client organisations, to save them time and money.\n\n \n\nAt Southgate we look for talented and enthusiastic employees who will contribute their best skills and efforts, which is rewarded with excellent growth opportunities, employee benefits programs and fostering a fun and friendly team.\n\n \n\n \n\nThe Perks for You:\n\nWorking at Southgate, you will have access to our own Employee Benefits Program and more, including: \n\nA competitive salary\nAccess to salary packaging to save on Income Tax (with Novated Leasing and other lifestyle benefits)\nElectric Vehicles via Novated Lease – Income Tax and FBT Free (including free onsite EV charging)\nAccess to amazing discounts on new cars and finance for yourself, family and friends.\nCareer progression opportunities\nProfessional development and training opportunities\nBreakout areas including Cinema Room, Pool Table, Gaming, BBQ.\nStaff incentives and rewards\nBirthday day off\nRegular staff activities\nCasual Fridays\nFree onsite parking\nModern offices in Port Melbourne (close to CBD)\n\n \n\n \n\nIf you have a passion for developing new innovative systems and enjoy working in a collaborative proactive environment, we would love to hear from you.\n\n \n\nPlease attach a Cover Letter to your application, clearly outlining your experience and suitability for the role based on the above criteria.\n\n \n\nAll applications should be submitted online via Seek.\n\n \n\nPlease Note:\n\nAll applications are strictly confidential. Only short-listed candidates will be contacted.\n\nUnsolicited applications from recruitment agencies or third parties will not be accepted.",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?",
      "How many years' experience do you have as a Full Stack .Net Developer?",
      "What are the 3 most important factors/attributes that you want from a new job?"
    ]
  },
  {
    "title": "Multiple Software Developers | Federal Government Opportunities",
    "url": "https://www.seek.com.au/job/78300577?type=standout&ref=search-standalone&origin=cardTitle#sol=2f5990ec36111706d102c918e83e8cddf817b072",
    "company": "Corroboree Talent Ltd",
    "location": "Canberra ACT",
    "salary": "",
    "jobType": "This is a Contract/Temp job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Federal Government Opportunities!",
      "Long Term Contracts!",
      "Competitive Daily Rate with Benefits!"
    ],
    "description": "We are looking for multiple Software Developers as we are expecting multiple opportunities with our Federal Government Clients. If this is you, Apply!",
    "postedDate": "4d ago",
    "fullDescription": "We specialise in connecting top software development talent with high-impact roles within federal government agencies. With our extensive network and deep understanding of the public sector, we offer unique contracting opportunities for Software Developers who are eager to contribute to projects that make a difference on a national scale.\n\nWhy Work With Us?\n\nExclusive Contracts: Access to a broad range of federal government projects that require cutting-edge software solutions.\nTailored Placement: We carefully match your skills, experience, and career goals with the most suitable opportunities.\nComprehensive Support: From onboarding to contract completion, our team provides full support to ensure your success.\nExpected Opportunities:\n\nFront-End Developers\nBack-End Developers\nFull-Stack Developers\nSpecialised Developers (e.g., Mobile, API, Cloud)\nKey Responsibilities:\nFront-End Developers:\n\nDevelop responsive and user-friendly interfaces using modern web technologies (e.g., HTML, CSS, JavaScript, React, Angular).\nCollaborate with UX/UI designers to ensure high-quality user experiences.\nOptimise applications for maximum speed and scalability.\nTroubleshoot and resolve front-end issues across various devices and platforms.\nBack-End Developers:\n\nDesign, develop, and maintain server-side logic, databases, and APIs.\nEnsure the performance, security, and scalability of applications.\nCollaborate with front-end developers to integrate user-facing elements with server-side logic.\nDebug and resolve issues related to back-end systems.\nFull-Stack Developers:\n\nDevelop and maintain both front-end and back-end components of web applications.\nWork closely with stakeholders to define project requirements and deliver robust solutions.\nImplement best practices in code quality, testing, and deployment.\nTroubleshoot and optimise applications across the entire stack.\nSpecialised Developers:\n\nDevelop specialised software solutions, such as mobile apps, cloud-based systems, or API integrations.\nLeverage expertise in specific technologies (e.g., Swift, Kotlin, AWS, Azure) to deliver tailored solutions.\nCollaborate with cross-functional teams to ensure seamless integration and deployment.\nStay up-to-date with emerging technologies and industry trends.\nWhat We’re Looking For:\nFront-End Developers:\n\nStrong proficiency in HTML, CSS, and JavaScript frameworks (e.g., React, Angular, Vue.js).\nExperience with responsive design and cross-browser compatibility.\nFamiliarity with version control systems like Git.\nStrong problem-solving skills and attention to detail.\nBack-End Developers:\n\nProficiency in server-side languages (e.g., Java, Python, Node.js, C#).\nExperience with databases (e.g., SQL, NoSQL) and RESTful APIs.\nKnowledge of security best practices and server infrastructure.\nStrong debugging and optimisation skills.\nFull-Stack Developers:\n\nExpertise in both front-end and back-end technologies.\nAbility to manage the complete development lifecycle from concept to deployment.\nFamiliarity with cloud platforms (e.g., AWS, Azure) and DevOps practices.\nStrong communication and collaboration skills.\nSpecialised Developers:\n\nDeep expertise in your specialised area (e.g., mobile development, cloud architecture, API development).\nExperience with relevant tools and platforms (e.g., Swift for iOS, AWS Lambda, RESTful APIs).\nAbility to deliver high-quality solutions that meet specific project requirements.\nProactive approach to staying current with technology trends.\nGeneral Requirements:\n\nStrong analytical thinking and problem-solving skills.\nExcellent communication and teamwork abilities.\nPrevious experience in federal government projects or large-scale software development is highly regarded.\nBenefits of Contracting with Us:\n\nCompetitive Rates: Earn attractive daily rates based on your expertise and the role.\nCareer Advancement: Opportunities to work on a variety of challenging and impactful projects.\nTrusted Recruitment Partner: Leverage our deep industry knowledge and commitment to your professional success.",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?",
      "Which of the following programming languages are you experienced in?",
      "Have you worked in a role which requires JavaScript development experience?",
      "How many years' experience do you have in a software development role?",
      "How many years' experience do you have using SQL queries?",
      "Which of the following Relational Database Management Systems (RDBMS) are you experienced with?",
      "Have you worked in a role which requires C# development experience?",
      "How many years' experience do you have in a DevOps role?",
      "What is your hourly rate inclusive of super excluding GST?",
      "What type of developer are you? what specific opportunities are you most interested in?",
      "Do you have an AGSVA Security Clearance?"
    ]
  },
  {
    "title": "Senior Software Engineer",
    "url": "https://www.seek.com.au/job/78294686?type=standout&ref=search-standalone&origin=cardTitle#sol=2029f0f3b6ae75ccb9795de1006986f1c50fe64c",
    "company": "Ofload",
    "location": "Sydney NSW",
    "salary": "$150,000 - $170,000 + bonus + superannuation",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Ranked #2 in The Australian Financial Review BOSS Best Places to Work!",
      "Play a major role in the development of our platform!",
      "Hybrid working environment."
    ],
    "description": "Join Ofload and become part of a fast-growing technology leader reshaping Australia's logistics landscape working with PHP and React.",
    "postedDate": "4d ago",
    "fullDescription": "About Ofload and our mission \n\nJoin Ofload and become part of a fast-growing technology leader reshaping Australia's logistics landscape. Ranked #2 in The Australian Financial Review BOSS Best Places to Work List in the Transport and Construction category, we're not just a team; we're a community of mission-driven professionals dedicated to eliminating waste in road freight. \n\nHere, every day is an opportunity to collaborate with diverse experts, solve challenging problems, and make a tangible impact on the environment and the industry.\n\nAbout the Role:\n\nOur Engineering team is given trust and autonomy to do great work. We work in small teams focused on specific features of our core platform, with 4-5 Engineers including a Technical Lead. We work in a triad with Product Managers and Designers to solve problems for our customers. \n\nWe are working with PHP8.2, Laravel 9, React.js, GraphQL and Node.js. It’s important that you have PHP/Laravel experience, however, you will also have the opportunity to work with Node.js. Our infrastructure is built on AWS, GitHub Actions, Kubernetes (EKS) and Docker.\n\nWhat you’ll do:\n\nDesign and develop highly scalable, reliable, and fault-tolerant systems with PHP/Laravel and React.JS.\nTranslate business requirements into scalable technical solutions.\nTake responsibility for multiple services maintained by the team.\nBuild and manage automated build/test/deployment environments.\nImprove your code quality, product execution, and learning experience.\nPlan and execute together with Backend, Mobile, DevOps, Data, UI/UX, QA.\nUse DDD, Design patterns, and advanced Git to produce maintainable code.\n\n\nRequirements:\n\nProven experience as a Senior Fullstack Engineer designing, developing, testing, deploying in PHP and React or Vue.\nPassionate about Test Driven Development.\nExperience working in a team.\nExperience in software development or a serious open source track record.\n\nAt Ofload we prioritise impact, aptitude and passion, so we’d encourage you to apply if you do not meet all the above criteria.\n\nOfload: Drive Your Career Forward in a Community Committed to Innovation and Sustainability\n\nJoin Ofload and become part of a fast-growing technology leader reshaping Australia's logistics landscape. Ranked #2 in The Australian Financial Review BOSS Best Places to Work List in the Transport and Construction category, we're not just a team; we're a community of mission-driven professionals dedicated to eliminating waste in road freight.\n\nHere, every day is an opportunity to collaborate with diverse experts, solve challenging problems, and make a tangible impact on the environment and the industry.\n\nAs an Ofload team member, you'll enjoy:\n\nOwnership and Reward: Become a co-owner through our Employee Share Option Plan and celebrate shared success as our company grows.\nEmpowerment and Growth: Thrive in a fast-paced, supportive atmosphere that values innovation, learning, and personal growth. With opportunities to tackle significant industry challenges, you're empowered to achieve great things.\nFlexibility and Wellbeing: Balance your life with hybrid work arrangements, including remote work options and additional leave for volunteering, celebrations, and personal milestones.\nCommunity and Connection: Experience a family-like atmosphere where respect, support, and camaraderie are part of everyday life. Join us for team retreats, enjoy weekly team breakfasts and after-work drinks, and participate in a culture that celebrates diversity and open communication.\n\nJoin Ofload and be a part of a visionary company where your work drives real change, and your growth is limitless.",
    "employerQuestions": [
      "Salary Expectation",
      "At Ofload we work in a hybrid model. Are you comfortable working in our Sydney office (155 Clarence Street) every Monday, Wednesday and Friday?",
      "Do you have full Australian working rights?",
      "How did you hear about Ofload?"
    ]
  },
  {
    "title": "C# .Net Windows Application Software Developer - W.A Remote Role",
    "url": "https://www.seek.com.au/job/78389886?type=standard&ref=search-standalone&origin=cardTitle#sol=714f87da9e9738523c81aa79b3a1d93fac00b3f5",
    "company": "Emydex Technology",
    "location": "Perth WA",
    "salary": "",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "The successful candidate will form a key part of the company's development team and has the chance to progress quickly in our growing business",
    "postedDate": "17m ago",
    "fullDescription": "C# .Net Windows Application Software Developer (W.A Remote Role)\n\nEmydex Technology is currently looking for a stand out Software Developer who embodies all our values of:\n\n#Empowerment #YesMinded #Dependability #Excellence #Integrity #Teamwork\n\n \n\nPlease note, that this is not an open role for a Web Based Developer.  This job advertisement is for a Windows Form Application Developer.\n\nWe are an Irish Software Development company providing Software Solutions to over 100 leading Food & Meat Processing companies in Ireland, the UK, France, Namibia, Botswana, South Africa, North America, Australia and New Zealand.  \n\n\nToo look a little further into our company profile and to see what we are all about, check out our:\n\nLatest news and what we have been up too: https://www.emydex.com/news/\nFacebook page here with some staff event photographs: https://www.facebook.com/Emydex-Technology-344547285589514/ \nLinkedIn Profile which helps show you what Emydex is all about: https://www.linkedin.com/company/emydex-technology\n\nOur customers include some of the largest food processing companies in Ireland such as the Kerry Group, Kepak Group and Dawn Meats Group as well as the Dunbia Group and Moy Park in the UK, plus a number of high profile customers in Australia.\n\nThe Candidate:\n\nThe C# .Net Windows Application Software Developer should have all of the following skills and experience:\n\nFood Processing Industry Knowledge (preferred)\nStrong knowledge of Microsoft .NET technology\nProficient in C# language\nGood understanding of object-oriented programming\nWork experience in Microsoft SQL Server\nExperience working with Windows Forms Application\nWorking knowledge of Azure DevOps\nExposure to DevExpress tools would be an advantage.\nNo Visa restrictions to travel (Travel may be required to certain customer sites)\n\nResponsibilities: \n\nDesign, develop and configure .Net applications in accordance with agreed customer requirement specifications.\nComplete application design, code, unit test and integration test tasks to .Net development standards\nProvide technical support where required.\nKnowledge of Food Processing Industries would be advantageous but not necessary.\nCommunicate with clients, take ownership and resolve issues.\n\nEmydex Working Environment: \n\nAt Emydex, we value our employees and strive to create an engaging and enjoyable working environment that promotes personal growth while working with a leading-edge tool-set. This is a Telecommuting position in which the employee works from a home office. The employee will communicate with the team via telecommunication links, keeping in touch with co-workers and employers via Microsoft Teams and other internet communication tools. They will be required to occasionally travel to our corporate head office in Dublin, Ireland.  \n\nEmydex Technology are an equal opportunity employer. \n\nEncouragement, guidance and support for those that want to self-improve and up-skill\nTime in lieu for overtime worked\nFlexible working hours (possible)\nExtra days’ holiday per year of service\nFinish Early Fridays\nNo meetings Wednesdays\nRefer a friend scheme\nBonuses are negotiable based off achievement of KPI objectives\n\nWe provide the latest versions of all our tools including:\n\nVisual Studio\nResharper\nRedgate SQL Tools\nDevExpress\nAzure",
    "employerQuestions": [
      "What's your expected annual base salary?",
      "Which of the following statements best describes your right to work in Australia?",
      "How many years' experience do you have as a software developer?",
      "Which of the following programming languages are you experienced in?"
    ]
  },
  {
    "title": "Senior .Net Developer - ICT",
    "url": "https://www.seek.com.au/job/78337677?type=standout&ref=search-standalone&origin=cardTitle#sol=9ed42292c5327dc6dff73a0297d95f76d555fd5b",
    "company": "Peoplebank Australia QLD",
    "location": "Brisbane QLD",
    "salary": "$115 - $123 p.h.",
    "jobType": "This is a Contract/Temp job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Initially until mid 2025 (with potential extension)",
      "Brisbane CBD and WFH options",
      "Weekly payments and No agency fees"
    ],
    "description": "Exciting opportunity with State Government department in Brisbane CBD.",
    "postedDate": "3d ago",
    "fullDescription": "Senior .NET Developer\nAbout the Job\n\nWe are seeking a highly skilled Senior .NET Developer to join our dynamic team. You will be responsible for providing design, development, maintenance, and support services across various projects. This role involves working with multiple teams within the Information & Technologies Branch to deliver high-quality solutions.\n\nResponsibilities\nDesign, develop, and maintain business information systems and application programming interfaces (APIs) throughout the software development lifecycle.\nCollaborate with cross-functional teams, including Application Environment, Database Operations, and Enterprise Integration Platform, to ensure seamless project delivery.\nPerform system enhancements and migrations for various initiatives, such as SBS - TSS Reduction Data and SBS - Angular upgrade.\nUtilize Microsoft technologies to reduce environmental complexity and improve system performance.\nReview processes and suggest improvement opportunities to enhance overall efficiency.\nManage change requests and incidents using Service Now as part of the Change Management Processes.\nSkills and Experience\nMinimum five years of demonstrated experience in Microsoft ASP.NET/MVC software development.\nProficiency in Microsoft SQL Server (2012-2019) including SQL Azure, with strong skills in stored procedures, scripts, and performance optimization.\nExtensive experience with Microsoft .NET (3.5 - 4.8.x and .NET Core) and Visual Studio 2019.\nKnowledge of Microsoft Azure Services, Windows Server, PingFed, Azure DevOps, and Reporting Services 2016.\nStrong programming skills in SQL and experience with XML Web services and APIs.\nAbility to work in an Agile software development team and use DevOps for Agile development and delivery.\n\nApply now or contact Felipe Rabelo on 07 3291 5412 for more information.\n\nJob Number: 263528\n\nDiversity and inclusion are strongly supported at Peoplebank. People of all nationalities, gender identities, and cultural backgrounds, including Aboriginal and Torres Strait Islander Peoples, are encouraged to apply.",
    "employerQuestions": []
  },
  {
    "title": "Full Stack .Net Developer",
    "url": "https://www.seek.com.au/job/78275703?type=standout&ref=search-standalone&origin=cardTitle#sol=32f8162b353a6b5693c5317b590fe26ab7dd790c",
    "company": "Stanwell Corporation Limited",
    "location": "Brisbane QLD",
    "salary": "",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "We need your C#/.NET experience to support the Stanwell Energy team",
      "Hybrid work environment at modern CBD office",
      "Competitive base salary + bonus + 12.75% super"
    ],
    "description": "The primary purpose of this role is to drive continuous innovation in IT systems for Stanwell Energy.",
    "postedDate": "5d ago",
    "fullDescription": "About Stanwell\n\nStanwell provides the spark for a bright future, and that future starts now. With our corporate office in Brisbane’s CBD and sites in the South Burnett and Rockhampton regions, we are a supplier of energy solutions to Queensland, the National Electricity Market, and large energy users throughout Australia. With more than 3 GW of renewable generation projects and firming capacity under development, we have an extensive renewable energy pipeline, with a goal of 9 to 10 GW of renewable energy and 5 GW of energy storage in place by 2035.\n\nSo, if you’d like to be part of the clean energy transformation in Queensland, working at Stanwell might be for you.\n\nWe care. We adapt. We deliver. These values are the driving force behind everything we do. And as we grow and deliver that pipeline of projects in the coming years, we will continue to serve our communities and deliver the power that Queensland needs.\n\nAbout the role\n\nThis is a full-time permanent opportunity located in Brisbane CBD.\n\nThe primary purpose of this role is to drive continuous innovation in IT systems for Stanwell Energy (Stanwell’s retail division), enhancing existing legacy systems built on C#/.NET Framework with Durandal, and maintaining and developing newer systems running in Azure, using C#/.NET Core with Remix/React frontends.\n\nThe Full Stack .NET Developer will design, develop, and maintain both the front- and back-end components of these web applications, ensuring robust and scalable solutions. The role involves managing databases, integrating cloud services, and ensuring the security and performance of systems. \n\nKey activities include:\n\nPerform maintenance and enhancements to existing systems written in C#/.NET, Durandal and Remix as directed by the Manager Technology, Innovation and Analytics.\nUse Microsoft Azure DevOps to manage code and build and deploy pipelines.\nMonitor on-premise and cloud applications for errors.\nSuggest system improvements and work with stakeholders to implement these improvements.\nRetail electricity industry is desirable but not essential.\n\nAbout you\n\nDevelopment experience with specific expertise in C# and web technologies.\nExperience with C#/.NET Core and Entity Framework.\nProficient with SQL (Structured Query Language) in SQL Server and Oracle databases.\nExperience with React/Remix is desirable.\nAbility to work directly with end-users and external stakeholders to deliver solutions.\n\nBenefits:\n\n12.75% employer contribution to superannuation\nAccess to Bright Spark – our rewards, recognition and discounts platform\nWeekly pay\nContributions for IP/TPD insurance units \nFlexible work arrangements\nCentrally located in Brisbane CBD\nIncentive scheme\nHealth and wellbeing initiatives (e.g. skin checks, flu vaccines)\nAccess to learning and development on and off the job\nExceptional safety culture\nPlus, a whole lot more!\n\nWhat’s next?\n\nTo submit your application, please apply online with your CV.\n\nApplications close: 11:55pm, 4 September 2024\n\nFurther information on Stanwell can be found online at www.stanwell.com\n\nAs part of the recruitment process, you may be required to undertake pre-employment checks (may include police checks, AusCheck, medical assessment and/or drug and alcohol testing). \n\nInclusion and diversity are an important part of shaping Stanwell’s culture and how our workplace operates. We recognise and value that it’s essential to creating a safe, inclusive, and productive workplace.\n\nWe are proactive about giving our people opportunities to excel and truly be themselves. We enable this through diversity, fairness, and flexible work practices.\n\nIf you have any support or access requirements, we encourage you to advise us at the time of application.",
    "employerQuestions": []
  },
  {
    "title": "APS6 - Java Developer, Traveller System Platforms Section",
    "url": "https://www.seek.com.au/job/78292549?type=standout&ref=search-standalone&origin=cardTitle#sol=2ff2c8bd8e558867095958bc7eed0d2c2f7927dd",
    "company": "Department of Home Affairs",
    "location": "Belconnen",
    "salary": "",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Work with a collaborative and caring team",
      "Professional and personal growth opportunities",
      "Office located in Belconnen, ACT"
    ],
    "description": "We are seeking Java Developers at an APS6 level to fill positions in Traveller System Platforms Section within ICT Division.",
    "postedDate": "4d ago",
    "fullDescription": "APS6 - Java Developer, Traveller System Platforms Section\n\nJob Req ID\n\nHome Affairs - 133757\n\n \n\nLocation\n\nACT \n\n \n\nClassification\n\nAPS Level 6 - $90,199.00 and $103,770.00 plus 15.4% super (part time pro-rata)\n\n \n\nEmployment Type\n\nOngoing (Permanent), Full-time \n\n \n\nFlexible work\n\nFlexible arrangements considered \n\n \n\nContact Officer\n\nBobbie-marree Barton on 0438 498 911 or Bobbie-marree.Barton@Homeaffairs.gov.au \n\n \n\n\n\n\nApplications close on 03/09/2024 at 11:59pm AEST (midnight) - Late applications will not be accepted.\n\n \n\nAbout our opportunity\n\n \n\nThis process is being used to fill up to 3 immediate vacancies. A merit pool may be established and used to fill similar vacancies for up to 18 months. \n\n \n\nAbout our team\n\n \n\nGM Technology & Major Cap Group | Major Capability | Traveller Cargo & Trade Systems | Traveller System Platforms Section\n\n \n\nThe Traveller System Platforms (TSPS) Section designs, develops, implements and maintains application solutions to enable travellers to safely cross Australian international Borders by leveraging industry supported technologies through well established strategic industry partnerships.\n\nTSPS delivers high quality and accessible business services to our front-line workforce Australian Border Force and cross Government agencies through industry supported secure data sharing technologies. TSPS is progressing fit for purpose, industry supported technology capabilities to Simplify and Rationalise the Traveller ICT landscape.\n\nPartnering with industry experts and both Business and Enterprise Architecture, TSPS are reducing technical risks to the Departments operational frontline services that secures the Australian Borders by delivering supported technology solutions aligned to Business and ICT Strategies. Specifically new Smart Gate Gen3 technology for passengers arriving into Australia by air.\n\n \n\nPlease visit our website for more information about the Department of Home Affairs or Australian Border Force\n\n \n\nOur ideal candidate\n\n \n\nThe APS 6 Developer assists in the creation of user information solutions by developing, implementing, and maintaining Java based components and interfaces. The person in this job contributes to designs, and develops high-volume, low-latency applications for high performance and availability. One of the major tasks of the developer is to contribute to the entire development lifecycles, write well designed, testable and efficient code. A developer in this role must ensure that designs are in compliance to the business specifications.\n\nThe person in this job updates, maintains and adds functionality to an existing java software program. They should also:\n\nHave excellent problem solving skills and the ability to diagnose issues in complex systems\nWork collaboratively within a team environment, engaging effectively with business areas and other relevant internal and external stakeholders\nCollaborate in real time across multiple platforms including but not limited to: MS Teams, AzDo tasks comments, documents, and video conferences\nParticipates in all aspects of agile software development, including design, implementation, and deployment\nEngage with designers and front-end engineers, and collaborate with leading back-end engineers to create reliable APIs.\n\n \n\nDuties and responsibilities\n\n \n\nDeveloping, testing, debugging and diagnosing applications faults using programming languages within established testing protocols, guidelines and quality standards to ensure programs and applications perform to specification\nWriting and maintaining program code to meet system requirements, system designs and technical specifications in accordance with quality accredited standards\nReview code and technical documentation, to support knowledge transfer and accurate system documentation\nSupport, troubleshooting, root cause analysis and remediation of Production Systems\nParticipate in all aspects of agile software development, including design, implementation, and deployment\nUnder guidance building end-to-end systems optimised for speed and scale.\n\n \n\nAdditional information\n\n \n\nThe below is highly desirable for the position:\n\nQualification in information technology, computer science or software engineering or a related area, or equivalent experience or working towards qualification\nInterest in learning new tools, languages, workflows, and philosophies\nProfessional certifications relevant to information technology.\n\n \n\nExperience or exposure to any one or more of the following streams is desirable:\n\nAzure DevOps (Boards, Repos, Pipelines)\nASP.NET/Html/CSS\nJava\nSpring\nStruts with JSP (Java Server Pages)\nTypescript/Angular/React\nSource Control\nKnowledge and experience in Ruby, Java/JRuby, React, and JavaScript\nAt least one year of experience in building large-scale software applications\nExperience in building web applications\nExperience in designing and integrating RESTful APIs\nExcellent debugging and optimization skills\nExperience in unit/integration testing.\n\n\n\n\nHow to apply\n\n \n\nSubmit your application and CV through the Home Affairs’ recruitment system (ourPeople) before the closing date on 03/09/2024 at 11:59pm (midnight) AEDT – Late applications will not be accepted.\n\n \n\nAs part of your application you will be required to prepare and submit a one-page applicant response document in relation to the advertised role, outlining:\n\nHow your skills, knowledge and experience relate to 'our ideal candidate' will be relevant to this role\nWhy you are interested in the role and what you can offer us\nAny specific examples or achievements that demonstrate your ability to perform the role\n\n\n\n\nApplicant response documents must be a minimum 11pt font in MSWord or PDF format, include your full name and the Requisition Number – 133757 in the document footer.\n\n \n\nPrior to preparing your response it is recommended you review the Work Level standards relevant to the classification you are applying to. It may also be useful to refer to the Integrated Leadership Systems information relevant to the classification.\n\n \n\nEligibility\n\n \n\nTo be eligible for the position you must be an Australian Citizen.\n\n \n\nThe successful candidate will be required to obtain and maintain a Baseline Vetting (AGSVA) security clearance and an Employment Suitability Clearance (ESC).\n\n \n\nDiversity and inclusion\n\n \n\nThe Department is committed to workforce diversity and applicants who are Aboriginal and/or Torres Strait Islander, come from a diverse cultural or linguistic background or have a disability are encouraged to apply.\n\n \n\nRecruitAbility applies to this vacancy. Under the RecruitAbility scheme you will be invited to participate in further assessment activity for the vacancy if you choose to apply under the scheme; declare you have a disability; and meet the minimum requirements for the job. For more information visit: https://www.apsc.gov.au/recruitability\n\n \n\nTechnical assistance\n\n \n\nFor technical enquiries please call or email for assistance:\n\n \n\nEmail: recruitment@homeaffairs.gov.au\nPhone: 1300 793 883 (within Australia) or +61 2 6196 0444 (outside of Australia)\n\n \n\nPlease include any applicable screen captures, a response will be provided during business hours.\n\n \n\nNotes\n\n \n\nThe Department of Home Affairs offers an attractive remuneration package, including salary, superannuation benefits and flexible working conditions appropriate to the level of the position.\n\n \n\nThe Department may provide relocation assistance to eligible APS employees required to relocate. The level of assistance will vary depending on the reason for relocating and your personal circumstances. For further information please enquire with the contact officer listed in the advertisement.\n\n \n\nInformation about employment and advice on how to apply for vacancies can be obtained from the Department’s website at https://www.homeaffairs.gov.au/about-us/careers\n\n \n\nCandidates should be aware that in roles where vaccination against COVID-19 is required by public health orders/directions or other legislation proof of vaccination will be required. If a candidate is not fully vaccinated or is unwilling to be vaccinated within a reasonable time period, they may not be offered that role.",
    "employerQuestions": []
  },
  {
    "title": "Analyst Programmer",
    "url": "https://www.seek.com.au/job/78261187?type=standout&ref=search-standalone&origin=cardTitle#sol=e2ae22514d0c79ce6c3964c61defe2624b47fb7c",
    "company": "CBHS Health Fund Limited",
    "location": "Parramatta",
    "salary": "$125,000 – $130,000 per year",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Hybrid Work Environment",
      "Parramatta Location",
      "Private Health Insurance Company"
    ],
    "description": "Our members are at the heart of everything we do. Our vision is to deliver more than great health insurance, building healthier & happier communities.",
    "postedDate": "5d ago",
    "fullDescription": "About Us\n\nFor 70 years CBHS Health Fund Ltd has been a trusted Private Health Insurer committed to providing exceptional value for its members. Our members are at the heart of everything we do, and we aim to develop a trusted relationship with our members as a healthcare partner and not just a health insurer.\n\nAbout the Role\n\nAn opportunity exists for an Analyst Programmer to join our Information Services team based in Parramatta on a full-time basis. \n\nReporting to the Development Team Manager, we are seeking an individual to Design, develop, and maintain technology solutions for the various CBHS work streams.\n\nThe focus of the role will include:\n\nActively participate and contribute to the software development lifecycle\nDeliver high quality software projects \nProduce and maintain design specifications and technical architecture documentation \nProvide technical support \nTroubleshoot, debug, and diagnose system issues and propose solutions and remedies\nResearch and recommend industry best practices and tools\nMaintain system documentation alive and up to date, as system changes occur\n\nResponsibilities\n\nDelivery of development services within estimated time frames\nProposing cost-effective and high quality development/technical solutions to the business\nDesign and build high quality software within estimated time frames\nMaintain developed systems within a production environment\nDevelop and maintain system level documentation to reflect current state\nConduct peer to peer code reviews and provide constructive feedback\nProvision of high quality software delivery to internal customers\nEffectively communicate with various system users, both within and outside IS\nSupport the IS team and various areas of the business\nActively contribute to better development processes and methodologies\nMaintain personal skills and knowledge, and share with the wider development team\n\n About you\n\nTo be considered for the role, you will, ideally have \n\nCompleted a Computer Science degree or certification\nStrong understanding of SOA, design patterns, OOP and TDD concepts\nExperience with .NET (4.0+, core) development experience incorporating ASP.NET, C#.NET, ADO.NET, XML, Web Services (REST & SOAP), MVC, JavaScript, JQuery, Ajax\nThorough understanding of SQL with SQL Server (2014+), T-SQL and Stored Procedures development experience\nExperience in Microsoft Azure technologies (functions, logic apps, API Management, etc.) (desirable)\nExperience in Agile and Devops processes (desirable)\nExperience with PowerBuilder (optional)\n\n What We Are Offering\n\nAn opportunity to thrive in a flexible and remote based working environment\nWorking with in an organisation with a first class culture and exceptional benefits\nThe tools to excel including a Surface Device and a full Work From Home setup\nOrganisationally support training and up skilling both internally and externally\nAn ever changing an evolving environment on the forefront of new technologies, modern practices and digital adoption\nThe opportunity to question, propose, change and create a lasting mark of success\n\nPlease apply with a cover letter outlining your suitability for the role and resume without delay!\n\nPlease note, while we give careful consideration to all applications received, only shortlisted candidates will be contacted.\n\nDuring the selection process, candidates will be required to undergo additional background checks including verification of experience and qualifications in determining their suitability for the role. Successful candidates will also need to agree to undergo a National Police Check",
    "employerQuestions": [
      "Which of the following programming languages are you experienced in?",
      "How many years' experience do you have using SQL queries?",
      "Which of the following statements best describes your right to work in Australia?",
      "How many years' experience do you have as an analyst programmer?",
      "Have you worked in a role which requires C# development experience?",
      "What's your expected annual base salary?",
      "How much notice are you required to give your current employer?"
    ]
  },
  {
    "title": "APS5 - Java Developer, Traveller System Platforms Section",
    "url": "https://www.seek.com.au/job/78292512?type=standout&ref=search-standalone&origin=cardTitle#sol=05c0590265f77ea654aebe0a83e6fbde8f17a4c8",
    "company": "Department of Home Affairs",
    "location": "Belconnen",
    "salary": "",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Work with a collaborative and caring team",
      "Professional and personal growth opportunities",
      "Office located in Belconnen, ACT"
    ],
    "description": "We are seeking Java Developers at an APS5 level to fill positions in Traveller System Platforms Section within ICT Division.",
    "postedDate": "4d ago",
    "fullDescription": "APS5 - Java Developer, Traveller System Platforms Section\n\nJob Req ID\n\nHome Affairs - 133758\n\n \n\nLocation\n\nACT \n\n \n\nClassification\n\nAPS Level 5 - $80,748.00 and $87,572.00 plus 15.4% super (part time pro-rata)\n\n \n\nEmployment Type\n\nOngoing (Permanent), Full-time \n\n \n\nFlexible work\n\nFlexible arrangements considered \n\n \n\nContact Officer\n\nBobbie-marree Barton on 0438 498 911 or Bobbie-marree.Barton@Homeaffairs.gov.au \n\n \n\n\n\n\nApplications close on 03/09/2024 at 11:59pm AEST (midnight) - Late applications will not be accepted.\n\n \n\nAbout our opportunity\n\n \n\nThis process is being used to fill up to 3 immediate vacancies. A merit pool may be established and used to fill similar vacancies for up to 18 months. \n\n \n\nAbout our team\n\n \n\nGM Technology & Major Cap Group | ICT Division | Traveller Cargo & Trade Systems | Traveller System Platforms Section\n\n \n\nThe Traveller System Platforms (TSPS) Section designs, develops, implements and maintains application solutions to enable travellers to safely cross Australian international Borders by leveraging industry supported technologies through well established strategic industry partnerships.\n\nTSPS delivers high quality and accessible business services to our front-line workforce Australian Border Force and cross Government agencies through industry supported secure data sharing technologies. TSPS is progressing fit for purpose, industry supported technology capabilities to Simplify and Rationalise the Traveller ICT landscape.\n\nPartnering with industry experts and both Business and Enterprise Architecture, TSPS are reducing technical risks to the Departments operational frontline services that secures the Australian Borders by delivering supported technology solutions aligned to Business and ICT Strategies. Specifically new Smart Gate Gen3 technology for passengers arriving into Australia by air.\n\n \n\nPlease visit our website for more information about the Department of Home Affairs or Australian Border Force\n\n \n\nOur ideal candidate\n\n \n\nThe APS 5 Developer assists in the creation of user information solutions by developing, implementing, and maintaining Java based components and interfaces. The person in this job contributes to designs, and develops high-volume, low-latency applications for high performance and availability. One of the major tasks of the developer is to contribute to the entire development lifecycles, write well designed, testable and efficient code. A developer in this role must ensure that designs are in compliance to the business specifications.\n\nThe person in this job updates, maintains and adds functionality to an existing java software program. They should also:\n\nHave excellent problem solving skills and the ability to diagnose issues in complex systems\nWork collaboratively within a team environment, engaging effectively with business areas and other relevant internal and external stakeholders\nCollaborate in real time across multiple platforms including but not limited to: MS Teams, AzDo tasks comments, documents, and video conferences\nParticipates in all aspects of agile software development, including design, implementation, and deployment\nEngage with designers and front-end engineers, and collaborate with leading back-end engineers to create reliable APIs.\n\n \n\nDuties and responsibilities\n\n \n\nDeveloping, testing, debugging and diagnosing applications faults using programming languages within established testing protocols, guidelines and quality standards to ensure programs and applications perform to specification\nWriting and maintaining program code to meet system requirements, system designs and technical specifications in accordance with quality accredited standards\nReview code and technical documentation, to support knowledge transfer and accurate system documentation\nSupport, troubleshooting, root cause analysis and remediation of Production Systems\nParticipate in all aspects of agile software development, including design, implementation, and deployment\nUnder guidance building end-to-end systems optimised for speed and scale.\n\n \n\nAdditional information\n\n \n\nThe below is highly desirable for the position:\n\nQualification in information technology, computer science or software engineering or a related area, or equivalent experience or working towards qualification\nInterest in learning new tools, languages, workflows, and philosophies\nProfessional certifications relevant to information technology.\n\n \n\nExperience or exposure to any one or more of the following streams is desirable:\n\nAzure DevOps (Boards, Repos, Pipelines)\nASP.NET/Html/CSS\nJava\nSpring\nStruts with JSP (Java Server Pages)\nTypescript/Angular/React\nSource Control\nKnowledge and experience in Ruby, Java/JRuby, React, and JavaScript\nAt least one year of experience in building large-scale software applications\nExperience in building web applications\nExperience in designing and integrating RESTful APIs\nExcellent debugging and optimization skills\nExperience in unit/integration testing.\n\n \n\nHow to apply\n\n \n\nSubmit your application and CV through the Home Affairs’ recruitment system (ourPeople) before the closing date on 03/09/2024 at 11:59pm (midnight) AEDT – Late applications will not be accepted.\n\n \n\nAs part of your application you will be required to prepare and submit a one-page applicant response document in relation to the advertised role, outlining:\n\nHow your skills, knowledge and experience relate to 'our ideal candidate' will be relevant to this role\nWhy you are interested in the role and what you can offer us\nAny specific examples or achievements that demonstrate your ability to perform the role.\n \n\nApplicant response documents must be a minimum 11pt font in MSWord or PDF format, include your full name and the Requisition Number – 133758 in the document footer.\n\n \n\nPrior to preparing your response it is recommended you review the Work Level standards relevant to the classification you are applying to. It may also be useful to refer to the Integrated Leadership Systems information relevant to the classification.\n\n \n\nEligibility\n\n \n\nTo be eligible for the position you must be an Australian Citizen.\n\n \n\nThe successful candidate will be required to obtain and maintain a Baseline Vetting (AGSVA) security clearance and an Employment Suitability Clearance (ESC).\n\n \n\nDiversity and inclusion\n\n \n\nThe Department is committed to workforce diversity and applicants who are Aboriginal and/or Torres Strait Islander, come from a diverse cultural or linguistic background or have a disability are encouraged to apply.\n\n \n\nRecruitAbility applies to this vacancy. Under the RecruitAbility scheme you will be invited to participate in further assessment activity for the vacancy if you choose to apply under the scheme; declare you have a disability; and meet the minimum requirements for the job. For more information visit: https://www.apsc.gov.au/recruitability\n\n \n\nTechnical assistance\n\n \n\nFor technical enquiries please call or email for assistance:\n\n \n\nEmail: recruitment@homeaffairs.gov.au\nPhone: 1300 793 883 (within Australia) or +61 2 6196 0444 (outside of Australia)\n\n \n\nPlease include any applicable screen captures, a response will be provided during business hours.\n\n \n\nNotes\n\n \n\nThe Department of Home Affairs offers an attractive remuneration package, including salary, superannuation benefits and flexible working conditions appropriate to the level of the position.\n\n \n\nThe Department may provide relocation assistance to eligible APS employees required to relocate. The level of assistance will vary depending on the reason for relocating and your personal circumstances. For further information please enquire with the contact officer listed in the advertisement.\n\n \n\nInformation about employment and advice on how to apply for vacancies can be obtained from the Department’s website at https://www.homeaffairs.gov.au/about-us/careers\n\n \n\nCandidates should be aware that in roles where vaccination against COVID-19 is required by public health orders/directions or other legislation proof of vaccination will be required. If a candidate is not fully vaccinated or is unwilling to be vaccinated within a reasonable time period, they may not be offered that role.",
    "employerQuestions": []
  },
  {
    "title": "Full Stack Engineer",
    "url": "https://www.seek.com.au/job/78266245?type=standard&ref=search-standalone&origin=cardTitle#sol=b3b49cc438642feed43bfd487d3ab6addfa90c88",
    "company": "ISOFT Software Technologies Pty Ltd",
    "location": "Sydney NSW",
    "salary": "$130,000 – $160,000 per year",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "The successful applicant can be based in Sydney or Melbourne.",
    "postedDate": "5d ago",
    "fullDescription": "Capability and Experience\n\nProficient in full stack and backend development, including Node.js (20+), Java, Spring / Spring Boot, Python (3), Angular (16+), React\nExtensive hands-on experience with AWS services such as CloudFormation, S3, Lambda, ECS, EKS, Glue ETL, API Gateway, IAM, SQS, SNS, Athena, DMS, DataSync\nSkilled in both SQL and no-SQL databases\nFamiliarity with test automation and test-driven development, utilizing mutation testing, UI visual regression (UI Path, Cypress), functional testing (Jasmine, Karma, Cucumber), and mock frameworks (Mockito)\nExpertise in designing and constructing REST APIs\nKnowledge of DevOps practices, tools, and continuous delivery pipelines (Bamboo, GitHub, Jenkins, Maven, Bitbucket, Jira)\nExperience applying Site Reliability Engineering principles, resiliency design patterns, and chaos engineering.\nFamiliarity with inner sourcing and promoting reuse principles and frameworks\nStrong communication skills, capable of translating technical concepts into business terms within Agile environments\nSelf-starter with a Growth mindset, adept at navigating ambiguity and demonstrating learning agility\nAbility to challenge the status quo and evaluate value delivery critically\nExtensive experience in the financial services industry, particularly in funds management\nProficiency in web technologies\n\nRole and responsibilities\nEngage with business stakeholders and other team members to ensure solutions are aligned to business outcomes.\nBring structure to business requests, translate requirements into an analytical approach, and executes through to completion.\nWork with the technical lead and the team to develop solutions, ensuring alignment to security and architectural standards.\nUnderstand Vanguard's tools, technologies, applications, and processes.\nIdentify opportunities for continuous improvement.\nProvide support to other team members in building skills and improving engineering practices",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?",
      "How many years' experience do you have as a Full Stack Software Engineer?",
      "How many years' experience do you have using SQL queries?",
      "How many years' experience do you have in a DevOps role?",
      "How many years' experience do you have in a software development role?"
    ]
  },
  {
    "title": "Software Developer",
    "url": "https://www.seek.com.au/job/78331525?type=standard&ref=search-standalone&origin=cardTitle#sol=2a00d3515d97bc81334e4f24219bb618c998dfff",
    "company": "Ampersand",
    "location": "Gold Coast QLD",
    "salary": "$100-123k+ Super",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "Seeking a highly skilled and experienced Mid Level Software Developer to join a dynamic technology team.",
    "postedDate": "3d ago",
    "fullDescription": "Fixed term Contract rate: $100-123k + Super \nLocation: Gold Coast\nContract duration: 9 months initially, likely to extend year on year\n\nPosition Overview:\n\nAs a Mid-Level Software Developer, you will play a crucial role in designing, developing, and maintaining applications. You will work with a diverse set of technologies, including Python, React, Terraform, and PowerShell. Experience with Azure is a plus, but not essential. Your contributions will be key to building scalable, reliable, and high-performance solutions.\n\nKey Responsibilities:\n\nDevelop and Maintain Applications: Write clean, efficient, and well-documented code using Python and React to build and enhance our applications.\nInfrastructure as Code: Utilize Terraform to define and manage infrastructure, ensuring scalability and reliability of our services.\nAutomation Scripting: Create and maintain automation scripts using PowerShell to streamline operations and improve efficiency.\nCollaboration: Work closely with cross-functional teams including designers, product managers, and other developers to deliver high-quality solutions.\nProblem Solving: Troubleshoot and resolve issues, ensuring the stability and performance of applications.\nCode Reviews: Participate in code reviews and contribute to improving development standards and practices.\nQualifications:\n\nExperience: 2-4 years of experience in software development with a focus on Python and React.\nTechnical Skills: Proficiency in Python, React, Terraform, and PowerShell.\nCloud Knowledge: Familiarity with Azure is a plus, but not required.\nProblem-Solving: Strong analytical skills with a proven ability to troubleshoot and resolve complex issues.\nCollaboration: Excellent communication and teamwork skills, with the ability to work effectively in a collaborative environment.\nAdaptability: Ability to learn new technologies and adapt to changing requirements.\nFor more information please Apply Now or contact Sam Taylor - staylor@ampersand.com.au",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?"
    ]
  },
  {
    "title": ".NET Developer (9 positions)- 12 + 12 Months Contract",
    "url": "https://www.seek.com.au/job/78212291?type=standout&ref=search-standalone&origin=cardTitle#sol=460bcc249ab44012c5f342380de9e1dd896d2013",
    "company": "SKILL'D People",
    "location": "Canberra ACT",
    "salary": "$120+ per hour. (All Fees Disclosed)",
    "jobType": "This is a Contract/Temp job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "9 Positions. Excellent $$. 12 + 12 Months Contract.",
      "Must be Australian Citizen. NV1 Clearance preferred.",
      "Lowest Fee*. 100% Transparent. No Lock-in."
    ],
    "description": "9 Positions. Excellent $$ - 12 + 12 Months Contract. Must be Australian Citizen. NV1 Clearance preferred. Flexible working.",
    "postedDate": "7d ago",
    "fullDescription": "Highlights\n9 positions available.\n12 + 12 Months Contract\nMust be Australian Citizen. \nNV1 Clearance preferred \nLocation: Canberra / Sydney / Melbourne / Brisbane / Adelaide  (Flexible work)\nClient: AEC\n\n \n\nEssential Criteria:\nStrong experience in developing automated application build and deployment scripts using the .NET environment (.NET Core), and additional Microsoft technology stack.\nDemonstrated experience with cloud-based applications development. \nBackend development experience using web API and SQL technologies.\nExperience with Visual Studio.\nDemonstrated experience with Agile software development methodologies and documentation.\nDemonstrated experience in SDLC.\nAbility to produce well designed, documented, and testable code. \nPeer review of developed products and scripts.\nKnowledge and experience in successfully setting priorities and delivering quality results on time and on budget.\nProven ability to communicate effectively whilst anticipating stakeholder needs and expectations across a geographically dispersed network.\nProven analytical abilities with the ability to propose and facilitate change and contribute to business improvement strategies.\nDemonstrated ability to manage staff while developing capabilities, encouraging career development, and promoting professionalism.\nDemonstrated personal integrity whilst achieving results within legislative and policy parameters.\nProficiency in using various IT applications and project management tools, including the MS Suite, Azure DevOps, and Miro or similar.\n\n \n\nDesirable Criteria:\n\nTertiary qualifications or industry recognised certification in Information Technology or Computer Science (or other relevant discipline).\nExperience in Cloud-based technologies.\nExposure to Microsoft Azure Dev Ops.\nExperience in technical analysis and design.\nExperience implementing integration requirements to perform end to end solution designs.\nKnowledge of, or ability to, quickly gain knowledge of Australian electoral law and practice.\n \nWhy SKILL'D?\nLowest Fee* - Our low fee means you are ultra competitive and more likely to win the position.\n100% Transparency - Open, Honest and Trusted. All fees are disclosed.\n100% Freedom - We don't have Lock-in clause, your freedom is guaranteed. \nRun by former contractors - With over 25+ years in ICT contracting, we have the knowledge and insights to win your next contract. \n \nContact\n\nCall: Senti ASAP on 0412 118 180 (including weekends) to get JD and for an open and honest chat or email:  jobs@skilld.au.\n\nOr Hit Apply now!",
    "employerQuestions": [
      "How many years' experience do you have as a .NET developer?",
      "Which of the following statements best describes your right to work in Australia?",
      "Do you hold Australian Security Clearance?"
    ]
  },
  {
    "title": "Junior/Intermediate Developer",
    "url": "https://www.seek.com.au/job/78107754?type=standard&ref=search-standalone&origin=cardTitle#sol=e5cd3f94fb724ae0ac35d4ad6a580b25c5fbaf71",
    "company": "DingGo",
    "location": "Rhodes",
    "salary": "",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "Come join us as we change the way Australians repair their vehicles.",
    "postedDate": "11d ago",
    "fullDescription": "We are DingGo!\n\nWe are currently seeking a highly motivated Junior/Intermediate Developer to join our high energy team and contribute to our continued success that is disrupting the automotive repair industry.\n\nFounded in 2018 and experiencing rapid growth, we are a tech platform that is transforming the smash repair industry through innovative technology and digitisation.\n\nAs an Accident management provider who works closely with Major Corporates, Government, Small business, Repairers and Insurance companies to achieve a customer first solution to repairing their vehicle, our geographical reach continues to expand, and we now need to take our business to the next level.\n\nCome join us as we change the way Australians repair their vehicles.\n\n \n\nAbout the Role:\n\nAs a Junior/Intermediate Developer, you will play a crucial role in the development of new features within our existing web stack, working alongside other senior developers. You will work directly with the business founders including the CTO who can help progress professional development and technical capabilities.\n\nAs a rapidly growing early-stage business you have the opportunity to shape the future direction of the role and even how the product evolves too.\n\n \n\nWhat we are looking for:\n\nMinimum of 2+ years work experience\nBack End Development - Writing and maintaining program code in Generic LAMP stack (Linux/Apache/MySQL/PHP). More specifically CakePHP which is a PHP MVC Framework similar to Django. This includes researching, analysing, discussing, designing and then implementing the development requirements in the DingGo Platform.\nBug Fixing - Testing, diagnosing, and correcting errors and faults in the DingGo Platform to ensure features or functions are working to specification.\nKnowledge of technologies - Staying on top of the latest technology and external systems in order to optimise any DingGo limitations in technology or processes\nDocumentation - Creating and maintaining appropriate technical documentation for features, functions, and processes\nAWS Implementation - AWS Implementation with the following services Route 53 EC2 -> 2 instances one for staging and one for production. EFS -> 2 disks for backup and storage of all image files. RDS -> 2 databases . Version Control / Github\n\n \n\nLife @ DingGo\n\nOur offices are in Rhodes (which includes a free gym membership and access to swimming pool) and easy access to public transport\nThe ability to grow with the business and forge your future career in the company, with wide opportunities across different departments.\nFlexible working arrangements\nMonthly lunches in the corporate park as well as office socials, themed days and celebrations\nYou will live and breath our core values focused on care, value and ease\n\n \n\nHow to Apply:\n\nInterested candidates should submit their resume and a cover letter outlining their relevant experience and explaining why they are a great fit for this position.\n\n \n\nDingGo is an equal opportunity employer and welcomes candidates from all backgrounds to apply. We look forward to adding driven and enthusiastic individuals to our growing team!",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?",
      "How many years' experience do you have as a developer?"
    ]
  },
  {
    "title": "Azure Migration Specialist - Application Migration Project",
    "url": "https://www.seek.com.au/job/78293595?type=standard&ref=search-standalone&origin=cardTitle#sol=008a1a0cf4732f6891a4c7e14cd6e0d8b126383c",
    "company": "The Aquarium",
    "location": "Canberra ACT",
    "salary": "Up to $1100 p/d + GST",
    "jobType": "This is a Contract/Temp job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "Senior Engineers required to migrate over 60 applications from a shared environment to a dedicated Azure platform,",
    "postedDate": "4d ago",
    "fullDescription": "Azure Migration Specialist – Application Migration Project\n\nLocation: Canberra or Remote (within Australia)\nContract Duration: 6 months (with possible extensions)\nStart Date: Within the next 2 weeks (ideal)\nSecurity Clearance Mandatory: Must be Australian Citizen with Baseline/NV1/NV2\nRate: Up to $1100 p/d + GST\n\nOverview:\nWe are partnering with a leading government agency which is embarking on a significant transformation project. The agency is migrating over 60 applications from a shared environment to a dedicated Azure platform, with the objective of achieving a 100% Azure environment by December 2024.\n\nProject Scope:\nThis Application Migration Project involves a combination of lift-and-shift, functional uplift, and cloud-native modernisation approaches. The goal is to ensure seamless integration with Azure services while addressing the challenges of adapting DevOps pipelines, managing manual deployments, and overcoming integration complexities.\n\nKey Responsibilities:\n\nMigration Execution: Lead and execute the migration of applications to Azure, ensuring successful lift-and-shift, adapting DevOps pipelines, managing manual deployments, and integrating seamlessly with Azure services.\nAzure Expertise: Provide expert support and maintenance for critical Azure components such as Azure B2C, APIM, and Front Door throughout the migration process.\nIntegration Management: Address integration challenges, particularly with external systems, leveraging available expertise and accelerators to ensure smooth connectivity and functionality in the new environment.\nEssential Requirements:\n\nProven Azure Expertise: Strong experience in Azure services, particularly in Azure B2C, APIM, Front Door, and related components.\nApplication Migration Experience: Demonstrated experience in executing lift-and-shift migrations of Azure-based applications, with a focus on ensuring connectivity and functionality in a new environment.\nProblem-Solving Skills: Ability to troubleshoot and resolve integration challenges, particularly in complex, multi-system environments.\nAvailability: Ready to start within the next 2 weeks and commit to a 6-month contract, with potential for extensions based on project needs.\n\nHow to Apply:\nIf you’re an Azure expert with a passion for cloud migrations and want to play a key role in a major transformation project, we’d love to hear from you. Please apply with your resume and specifically call out your application migration experience.",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?",
      "Existing security clearance is mandatory for this role. Do you have Baseline or NV1 OR NV2?",
      "What is your clearance level?"
    ]
  },
  {
    "title": "Application Developer (9812)",
    "url": "https://www.seek.com.au/job/78135866?type=standout&ref=search-standalone&origin=cardTitle#sol=8b04f703605b3e5dcc5065bacc62c09838ad1946",
    "company": "Hobart City Council",
    "location": "Hobart TAS",
    "salary": "$85,906 + 13% superannuation",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Great worl life balance",
      "Career Progression",
      "Attractive employee benefits"
    ],
    "description": "Join our innovative team as an Application Developer and work on cutting-edge projects that shape the future of technology.",
    "postedDate": "10d ago",
    "fullDescription": "Employment status: Permanent Full-time\nClassification: Municipal Officer Level 3\nAgreement: Hobart City Council Enterprise Agreement 2021\nSalary: $85,906 + 13% superannuation.\n\nAbout the role\n\nThis role Supports the delivery of the City of Hobart's digital transformation projects through the technical development of business systems via industry standard platforms.\n\nKey Responsibilities include:\n\nUnder the direction of a technical lead and project manager, work within a project team to assist in delivering solutions that meet end-user requirements.\nUnder supervision and direction:\n­undertake technical development and testing of SharePoint Online, PowerPlatform and Azure Integration solutions in test/development environments;\npromote approved developments and configurations to their production environment, including application update and patch management, using approved Change Management Protocols;\ntest, diagnose and resolve issues/defects/bugs; and\nwork with end users in designing and testing solutions.\n\n \n\nLearn more about the role in the position description: Application Developer Position Description\n\nAbout you\n\nJoin our innovative team as an Application Developer and work on cutting-edge projects that shape the future of technology. We are seeking a creative problem-solver with a passion for coding and a dedication to crafting seamless user experiences. \n\nEssential Qualifications\n\nBachelor Degree or higher in Information Technology.\nCurrent Registration to Work with Vulnerable People. \nCurrent Driver Licence.\n\nEssential Qualifications\n\nBasic understanding of contemporary integration tools, standards and protocols such as REST, JSON, RAML, ODATA along with related technologies such as Azure Git Source Control, Azure DevOps.\nStructured programming and debugging in python and C#.\nScrum task story board processes using Microsoft Azure DevOps.\nMicrosoft Azure deployment, navigation and debugging.Microsoft PowerAutomate and PowerApps.\nMicrosoft SharePoint Online, PowerPlatform and 365 platform administration.\n\n \n\nYou'll collaborate with cross-functional teams to design, develop, and deploy dynamic applications that meet our high standards of performance and reliability. At our company, you'll enjoy a vibrant work culture, opportunities for professional growth, and the opportunity to make a significant impact in a fast-paced, tech-driven environment. Apply now and take the next step in your career with us!\n\nAbout us\n\nThe City of Hobart offers something for everyone, with connections between nature, history, culture, businesses and each other. We are proud to provide a range of services and facilities that support the wellbeing, safety and participation of the community as well as continuously look to improve and embrace new approaches to achieve better outcomes for all. With an industrious and diversified economy, wherever your skills, talents and passions lie, we can offer you the opportunity to have a rewarding career with ongoing learning and development opportunities.\n\nWe recognise contributions to our workforce and offer:\n\nAbove Award wages and Employer Superannuation at 12.5% with salary sacrifice options.\nFlexible work arrangements including the option to apply for a nine-day fortnight.\nA wide range of paid leave entitlements.\nHealth and Wellness programs, including onsite gyms.\nDiscounted membership at Hobart Aquatic Centre.\nAbility to purchase additional leave after 12 months of service.\nAn Employee Assistance Program that offers onsite visits.\nCorporate Health Plan discounts with BUPA, St. Lukes and Medibank.\n\nLearn more about what the City of Hobart can offer you.\n\nThe City of Hobart is committed to building an inclusive community and workplace. As an equal opportunity employer, we encourage applications from people of all backgrounds, abilities, ages and identities.\n\nCity of Hobart has a strong commitment to health and safety. Appointment will be subject to satisfactory pre-employment background checks. These will include reference checks, National Police History record check, and Medical Assessment including drug and alcohol testing.\n\nLearn more about our vision, mission and values.\n\nHow to apply\n\nIf you require any further information specific to this role please contact Phillip Monk, Business Intelligence Lead, on 03 6238 2802 or email phillip.monk@hobartcity.com.au.\n\nAll applications must be made in the online portal, and you can save your application as you progress through the stages until you submit your final application. If you have any issues with submitting your application, please email details of the issue to recruitment@hobartcity.com.au. Please note that we do not accept applications via email or after the position has closed so if you have issues submitting your application, please contact us prior to the closing time.\n\nApplications close 11:59 pm Sunday 1 September 2024.",
    "employerQuestions": []
  },
  {
    "title": ".Net Developer",
    "url": "https://www.seek.com.au/job/78321861?type=standard&ref=search-standalone&origin=cardTitle#sol=ae94c4937b2b08beece8a90cfbe0cec3745a1b09",
    "company": "Clicks IT Recruitment (QLD)",
    "location": "Sunshine Coast QLD",
    "salary": "$100k - $120k p.a. + Super",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "Clicks IT Recruitment is working with a company within the technical agriculture sector.",
    "postedDate": "3d ago",
    "fullDescription": "Clicks IT Recruitment is working with a company within the technical agriculture sector. They use applications and reporting systems to allow their key stakeholders to create sustainable practices.\n\nThe Role:\n\nPermanent opportunity\nSalary: $100,000 - $120,000 + Super\nLocation: Sunshine Coast\nHybrid engagement - work from home flexibility\n\nIn this role, you will be part of a team developing and delivering information systems. You'll collaborate with stakeholders to build scalable software applications, implement features, and support existing technology. You'll work closely with business units to gather detailed requirements and enhance reporting systems. The role involves working with Blazor, Azure infrastructure, and blockchain technologies, where experience with blockchain will be a plus.\n\n\nThe Responsibilities:\n\nCollaborate with developers, UX designers, and analysts to implement technical designs.\nWrite and implement software according to specified requirements.\nMaintain and upgrade existing software, improving codebases and conducting peer reviews.\nMake performance-based recommendations for software improvements.\nProvide written knowledge transfer materials to support team learning.\nLiaise with colleagues to ensure smooth technical implementation and design.\n\nExperience Requirements:\n\nHold a bachelor's degree in computer science or engineering.\nPossess at least 3 years of experience with C# and .NET.\nHave a minimum of 1 year of development experience with Blazor.\nExperience with Azure services and infrastructure.\nApply best practices in object-oriented design and software architecture.\nFamiliarity with DevOps practices, including CI/CD pipelines and automated testing.\nStrong ability to prioritize, communicate clearly, and demonstrate excellent software engineering skills.\nExperience with WPF, blockchain technologies, or payment system integration is a plus.\n\nIf you wish to apply for this position, please submit your resume by clicking the 'Apply Now' button. For further information please contact Kate Pengelly at Clicks IT Recruitment on +61 419 721 158.\n\nAt Clicks we embrace diversity, inclusion and equal opportunity.\n\nWe provide reasonable adjustments, including alternate formats to the recruitment process for individuals with disability. If you require an adjustment to be made during the recruitment process, please call 1300 254 257 or email adjustments@clicks.com.au",
    "employerQuestions": []
  },
  {
    "title": "Intermediate Software Engineer",
    "url": "https://www.seek.com.au/job/78271518?type=standout&ref=search-standalone&origin=cardTitle#sol=535b4b43e4efeeb7549324800982cc13e8a37bf5",
    "company": "The Onset",
    "location": "Sydney NSW",
    "salary": "$130,000 - $150,000 + Super + Equity + Benefits",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Work with best in class engineers in a highly collaborative team",
      "Use modern .Net stack, practices and architectures",
      "Work Remote - Anywhere in Australia (must have full working rights)"
    ],
    "description": "A publicly listed scale up, that in the last few years has blown up internationally! SaaS company shipping high quality, scalable robust solutions.",
    "postedDate": "5d ago",
    "fullDescription": "All the benefits of a SF Icon\nRemote from anywhere in Australia \nPrivate health insurance\n16 weeks paternity leave\n$150 a month treat yourself budget\nExtra company-given holiday days!\nA publicly listed scale up, that in the last few years has blown up!\n\nHuge prospects for a visionary Software Engineer to support the vision, modernisation and scaling of the platform as the customer base continues to increase across their huge code base.\n\nGet stuck in as you investigate how these systems are currently used by customers and how you can enhance their experience. Ensuring high quality shipping, scalable and highly robust solutions, as well as software architecture and design.\n\nThis is a complex system, so expect to get your hands dirty. You will be directly involved in coding, design and architecture. You will be expected to be fluent in .Net Core, Cloud, CI/CD, Event Driven Architecture and Microservices.\n\nThis is an incredibly strong team of engineers that have a collaborative, knowledge sharing, dynamic mind-set that are best in class when it comes to engineering.\n\nExperience required:\n\n\nExceptional analytical and problem solving skills\nStrong technical problem solving and solution design\nDistinguished web development skills across .Net, React.js and Azure\nExperience across the Microsoft stack C#, .Net Framework, .Net Core and MVC.\nThe ability to consider all dimensions of the business issues into your technical role \nExperience in deployments and scaling of cloud based services (Azure preferable but not a deal breaker)\nIf you are ready to bring your expertise to a collaborative and supportive environment geared up for significant growth… Apply now or email Dani - danielle@theonset.com.au",
    "employerQuestions": []
  },
  {
    "title": "Principal Software Developer",
    "url": "https://www.seek.com.au/job/78204134?type=standout&ref=search-standalone&origin=cardTitle#sol=35ad3499e4fc30d22be8b83f090ceadf846dc95a",
    "company": "Department of Justice and Attorney- General (and Office of Public Guardian)",
    "location": "Brisbane QLD",
    "salary": "$127,842 - $136,895 per annum",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [
      "Permanent full-time",
      "$127,842 - $136,895 plus leave loading",
      "12.75% employer superannuation contribution"
    ],
    "description": "The Registry of Births, Deaths and Marriages objective is to register, protect and certify the identities and life event information Queenslanders",
    "postedDate": "7d ago",
    "fullDescription": "Technical skills, abilities and cultural capability\n\nProven ability to meet service delivery targets and implement quantifiable service improvements by managing workloads and priorities.\nExperience in utilizing IT service management frameworks and software development processes to , support, design and develop large and complex enterprise systems.\nProven experience in software development using Java with Spring Framework including spring-boot, web-services with strong JavaScript/JQuery.\nExperience in development and deployment of scalable, fit for purpose and secure cloud-based applications (preferably in AWS).\nProven ability to work with Relational databases (RDBMS) and basic PL/SQL.\nA sound understanding of DevSecOps practices and principles including hands on experience in CI/CD pipelines configuration and management.\nWell-developed interpersonal, oral and written communication skills with the ability to present and promote realistic software solutions that meet the needs of stakeholders and customers.\n\nApplications to remain current for 12 months.\n\nJob Ad Reference: QLD/585696/24\n\nClosing Date: Monday, 2 September 2024",
    "employerQuestions": []
  },
  {
    "title": "Developer Programmer",
    "url": "https://www.seek.com.au/job/78249697?type=standard&ref=search-standalone&origin=cardTitle#sol=b876b012bbebe4e3933011ed9842f4d1bbe1f063",
    "company": "Select Software R & D Pty Ltd",
    "location": "Sydney NSW",
    "salary": "Base Salary $74,000- $80,000 per year plus super",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "Select Software R & D Pty Ltd is a telecommunications company based in Sydney, Australia.",
    "postedDate": "5d ago",
    "fullDescription": "Select Software R & D Pty Ltd is a telecommunications company based in Sydney, Australia. We are committed to the ongoing development of highly specialised Customer Care and Converged Billing solutions. Our team is growing, and we are currently seeking a skilled Developer Programmer to join us.\n\nPosition Overview:\n\nWe are looking for a Developer Programmer to developing high-quality applications, maintaining existing software systems, and collaborating with cross-functional teams to deliver innovative solutions.The successful candidate will play a crucial role in designing, coding, and implementing software solutions that meet our business needs. \n\nKey Responsibilities:\n\nDesign, develop, and maintain applications such as Service Desk and Selcomm using tools and languages including DevOps, Visual Studio Code, Visual Basic 2019, VB.NET, JavaScript, AngularJS, C#, and Stored Procedures.\nPlan, design, and test intranet applications, ensuring seamless integration and functionality.\nUtilise Visual Basic 2019 for efficient testing, debugging, and resolution of programming issues.\nTrace and verify stored procedures using Putty to ensure optimal performance.\nConduct automated API testing with SoapUI or POSTMAN to validate requests and responses.\nCollaborate with the Technical Director and development team to design and implement new features.\nDevelop stored procedures, integrate databases, and establish connections for APIs and web services.\n\nKey Requirements:\n\nQualifications: A bachelor’s degree or higher qualification in IT\nExperience: At least three years of relevant experience\nSkills: Visual Studio Code, Visual Basic 2019, VB.NET, JavaScript, AngularJS, C#, and Stored Procedure.",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?",
      "How many years' experience do you have as a software developer?",
      "Which of the following programming languages are you experienced in?",
      "Have you worked in a role which requires C# development experience?",
      "Which of the following front end development libraries and frameworks are you proficient in?"
    ]
  },
  {
    "title": "Junior C++ Developer",
    "url": "https://www.seek.com.au/job/78040158?type=standard&ref=search-standalone&origin=cardTitle#sol=17a12c77edc4e75e6d5f2befeec3a005f44945f0",
    "company": "onQ Digital Group Pty Ltd",
    "location": "South Yarra",
    "salary": "",
    "jobType": "This is a Full time job",
    "classification": "(Information & Communication Technology)",
    "subClassification": "Developers/Programmers",
    "highlights": [],
    "description": "Junior C++ dev role for a high powered graduate with a passion for learning and development.",
    "postedDate": "13d ago",
    "fullDescription": "onQ Digital, established in 2012, is Australia’s leading provider of digital signage and software solutions. We specialize in providing state-of-the-art digital signage solutions that empower businesses to create engaging and dynamic visual displays. Our products include cutting-edge software, customizable hardware, and content management systems that make it easy to manage and distribute content across multiple locations and devices.\n\nWe're looking for a graduate C++ developer to join our growing software team to help us build a high performance, multi-platform, graphical application with various industry specific requirements. This role is best suited to a comp sci graduate with strong academic results or a new developer who can demonstrate high level skills using c++ to build applications. A detailed understanding of the C++ language, compilation and the fundamentals of operating system internals is a strict requirement.\n\nThis position is based in South Yarra, Melbourne and is a hybrid office/work from home role - we will only accept applicants living in Melbourne. The successful candidate must already have the right to work in Australia.\n\nRequirements\n\nStrong C++ coding skills \nSolid understanding of OS internals\nAbility to write clean, clear documentation\nExcellent communication and teamwork skills\nPassion for learning and self-development\n\nNice to Have\n\nExperience with C++ build tooling\nExperience with OpenGL\nExperience with Linux\nWorking knowledge of Git\n\nPlease provide an answer to the following questions with your application:\n\nWhat is your preferred tooling for building C++ applications?\nC++ is considered a 'cross-platform' language. In reality, what does this mean and what are its limitations?\nWhat are some of the dangers of developing in the C++ language and how do you mitigate them?\nWhat does great coding mean to you?",
    "employerQuestions": [
      "Which of the following statements best describes your right to work in Australia?"
    ]
  }
]